//============================================================================
// 
// ２０２５年５月９日：ゾーンクラスを作成 [Button.h]
// Author : 椎名太陽
// 
//============================================================================

#ifndef _Button_H_
#define _Button_H_	// 二重インクルード防止

//****************************************************
// インクルードファイル
//****************************************************
#include "object_2D.h"
//****************************************************
// 前方宣言
//****************************************************

//****************************************************
// ボタンクラス
//****************************************************
class CButton : public CObject_2D
{
public:
	// === 特殊関数 ===

	CButton(); // コンストラクタ
	~CButton() override;	// デストラクタ

	// === ライフサイクルメンバ関数 ===
	HRESULT Init() override;	// 初期設定
	void	Uninit() override;	// 終了処理
	void	Update() override;	// 更新処理
	void	Draw() override;	// 描画処理

	// === 静的メンバ変数 ===
	static CButton* Create(D3DXVECTOR3 InitPos); // 生成
private:
	int m_nAnimCnt; // アニメーションカウント
	int m_nMaxAnim; // アニメーション最大数
};

#endif // _PALYER_H_