//============================================================================
// 
// ２０２５年５月２０日：カメラ状態クラスを作る [camera_state.h]
// Author : 椎名太陽
// 
//============================================================================

#ifndef _CAMERA_STATE_H_
#define _CAMERA_STATE_H_	// 二重インクルード防止

//****************************************************
// 前方宣言
//****************************************************
class CCamera; // カメラ

//****************************************************
// usingディレクティブ
//****************************************************
using namespace useful;

//****************************************************
// カメラステートクラス
//****************************************************
class CCamera_State
{
public:
	// <special function>
	CCamera_State(); // コンストラクタ
	virtual ~CCamera_State() = 0; // デストラクタ

	// <function>
	virtual void Update(CCamera* pCamera) = 0; // 更新処理
private:
};
#endif // _Summon_MANAGER_H_