//============================================================================
// 
// ２０２５年４月２８日：ブロッククラスを作成 [Number.cpp]
// Author : 椎名太陽
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "number.h"
#include "bounding_box.h"

// 入力用
#include "manager.h"

// テクスチャ取得用
#include "texture_manager.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace useful;

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// コンストラクタ
//============================================================================
CNumber::CNumber() :
	CObject_2D{ LAYER::FRONT }
{
	SetType(CObject::TYPE::NUMBER); // タイプを「数字」に設定
}

//============================================================================
// デストラクタ
//============================================================================
CNumber::~CNumber()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CNumber::Init()
{
	// オブジェクト2Dクラスの初期設定
	if (FAILED(CObject_2D::Init()))
	{
		assert(false && "数字の初期設定に失敗");
	}

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CNumber::Uninit()
{
	// オブジェクト2Dクラスの終了処理
	CObject_2D::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CNumber::Update()
{
	// オブジェクト2Dクラスの更新
	CObject_2D::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CNumber::Draw()
{
	// オブジェクト2Dクラスの描画処理
	CObject_2D::Draw();
}

//============================================================================
// 生成
//============================================================================
CNumber* CNumber::Create(D3DXVECTOR3 InitPos)
{
	// インスタンスを生成
	CNumber* pNumber = DBG_NEW CNumber();

	// 生成失敗
	if (pNumber == nullptr)
	{ 
		assert(false);
	}

	// タイプを設定
	pNumber->SetType(TYPE::NUMBER);

	// === テクスチャ情報設定 ===

	pNumber->BindTex(CTexture_Manager::GetInstance()->RefRegistry().BindAtKey("Number_001"));
	pNumber->SetTexWidth(0.1f);  // 横幅１０分の１
	pNumber->SetTexHeight(1.0f); // 高さ１
	pNumber->SetNowPatternU(0);  // ０の位置にする
	pNumber->SetNowPatternV(0);  // ０の位置にする

	// === その他初期設定 ===

	pNumber->Init(); // 初期化処理

	pNumber->SetPos(InitPos);// 初期位置設定

	return pNumber;
}