//============================================================================
// 
// ２０２５年７月２３日：チュートリアルを実装する [PlayerState_HandSwordPractice.h]
// Author : 椎名太陽
// 
//============================================================================

//****************************************************
// インクルード
//****************************************************

// === オブジェクト ===

#include "Button.h"

// === 状態 ===

#include "PlayerState_HandSwordPractice.h" // 突きの前状態

// === その他 ===
#include "renderer.h"
#include "UiText.h"
#include "UiTextManager.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace useful;
using namespace std;

//****************************************************
// 静的メンバ変数
//****************************************************
bool CPlayerState_HandSwordPractice::s_bEndPractice = false;

//============================================================================
// 
// publicメンバ
// 
//============================================================================

//============================================================================
// コンストラクタ
//============================================================================
CPlayerState_HandSwordPractice::CPlayerState_HandSwordPractice(CPlayer* pPlayer, int nAnticipationFrame) :
	CPlayerState_BeforeThrust(pPlayer, nAnticipationFrame)
{
	s_bEndPractice = false; // 練習が始まったので終了していない
}

//============================================================================
// デストラクタ
//============================================================================
CPlayerState_HandSwordPractice::~CPlayerState_HandSwordPractice()
{
	s_bEndPractice = true;
}

//============================================================================
// 初期化処理
//============================================================================
void CPlayerState_HandSwordPractice::Init(CPlayer* pPlayer)
{
	// 何もなし
}

//============================================================================
// 終了処理
//============================================================================
void CPlayerState_HandSwordPractice::Uninit(CPlayer* pPlayer)
{
	// 何もなし
}

//============================================================================
// 更新処理
//============================================================================
void CPlayerState_HandSwordPractice::Update(CPlayer* pPlayer)
{
	// 基底クラス更新
	CPlayerState_BeforeThrust::Update(pPlayer);
}

//============================================================================
// 練習が終わったかどうか
//============================================================================
bool CPlayerState_HandSwordPractice::GetEndPractice()
{
	return s_bEndPractice;
}

//============================================================================
// 目的地を決める操作
//============================================================================
bool CPlayerState_HandSwordPractice::ControlDecisionGoal()
{
	return false; // この状態では操作不可能
}