//============================================================================
// 
// ２０２５年７月１０日：召喚関係のバグの改善とプレイヤー条件分岐をステートパターンにする [PlayerState.h]
// Author : 椎名太陽
// 
//============================================================================

//****************************************************
// ２重インクルード防止
//****************************************************
#ifndef _PLAYERSTATE_H_
#define _PLAYERSTATE_H_	

//****************************************************
// インクルードファイル
//****************************************************

//****************************************************
// 前方宣言
//****************************************************
class CPlayer; // プレイヤー

//****************************************************
// プレイヤー状態クラス
//****************************************************
class CPlayerState
{
public:
	// === 特殊関数 ===

	CPlayerState(CPlayer* pPlayer); // コンストラクタ
	virtual ~CPlayerState(); // デストラクタ

	// === ライフサイクルメンバ関数 ===
	virtual void Init(CPlayer* pPlayer) = 0;   // 初期化処理
	virtual void Uninit(CPlayer* pPlayer) = 0; // 終了処理
	virtual void Update(CPlayer* pPlayer) = 0; // 更新処理
private:
};
#endif // _COLLISION_H_