//============================================================================
//
// Roll軸回転制御、ヘッダファイル [rotator_roll.h]
// Author : 福田歩希
//
//============================================================================

// インクルードガード
#pragma once

//****************************************************
// Roll軸回転制御フラグの列挙型の定義
//****************************************************
enum class RotatorRollFlags : unsigned char
{
	None = 0,
	Swaying = 1 << 0,	// 揺れる
	Rolling = 1 << 1,	// 回転する
};

//****************************************************
// Roll軸回転制御クラスの定義
//****************************************************
class CRotatorRoll
{
public:

	//****************************************************
	// special function
	//****************************************************
	CRotatorRoll();

	//****************************************************
	// function
	//****************************************************
	
	/**
	 * フラグに応じてカメラの上方向ベクトルの操作を行う
	 * 返り値無し
	 */
	void Rotate(D3DXVECTOR3& vec);

	// 速度を設定
	inline void SetSpeed(float speed) { fSpeed_ = speed; }

	// 角度を設定
	inline void SetAngle(float angle) { fAngle_ = angle; }

	// フラグを設定
	inline void SetFlags(RotatorRollFlags flags) { Flags_ = flags; }

private:

	//****************************************************
	// data
	//****************************************************
	void Swaying(D3DXVECTOR3& vec);	// 揺れる
	void Rolling(D3DXVECTOR3& vec);	// 回転する

	//****************************************************
	// data
	//****************************************************
	RotatorRollFlags Flags_;	// 回転制御フラグ
	float			 fSpeed_;	// 速度
	float			 fAngle_;	// 角度
	int				 nLimit_;	// 処理寿命
};