//============================================================================
// 
// タイトル、ヘッダファイル [title.h]
// Author : 福田歩希
// 
//============================================================================

// インクルードガード
#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "scene.h"

//****************************************************
// 前方宣言
//****************************************************
class CObject_HUD;
class CObject_X;

//****************************************************
// タイトルクラス
//****************************************************
class CTitle final : public CScene
{
public:

	/**
	 * タイトル用の更新処理です、
	 * シーンマネージャーの更新で自動的に呼び出されます
	 */
	void Update() override;

	/**
	 * タイトル用の描画処理です、
	 * シーンマネージャーの描画で自動的に呼び出されます
	 */
	void Draw() override;

	/**
	 * 更新時にこの関数を呼ぶと、設定されている次のシーンに遷移します
	 * 基本的にフレーム更新の最後に呼び出してください
	 */
	void To_Next() override;

	/**
	 * タイトルシーンのインスタンスを生成します
	 */
	static CTitle* Create();

private:

	static bool s_bNextSceneIsTest; // 次のシーンをテストシーンにするかどうか

	//****************************************************
	// special function
	//****************************************************
	CTitle();			// デフォルトコンストラクタ
	~CTitle() override;	// デストラクタ

	//****************************************************
	// function
	//****************************************************
	HRESULT Init() override;	// 初期化処理
	void	Uninit() override;	// 終了処理
	void	GenerateLeaf();		// 葉っぱ発生

	//****************************************************
	// data
	//****************************************************
	CObject_HUD* m_pLogo;				// ロゴ
	CObject_X* m_apHideGrass[2];		// 隠れ草
	std::vector<CObject_X*> m_vpLeaf;	// 葉っぱ
	int m_nFrameCounter;				// フレームカウンター
};