//============================================================================
// 
// ２０２５年６月９日：OBB判定を実装 [TutorialPlayer.h]
// Author : 椎名太陽
// 
//============================================================================

//****************************************************
// ２重インクルード防止
//****************************************************
#ifndef _TUTORIALPLAYER_H_
#define _TUTORIALPLAYER_H_

//****************************************************
// インクルードファイル
//****************************************************
#include "player.h" // 基底クラスがある

//****************************************************
// チュートリアルプレイヤークラス
//****************************************************
class CTutorialPlayer : public CPlayer
{
public:

	// === 特殊関数 ===

	CTutorialPlayer();				// コンストラクタ
	~CTutorialPlayer() override;	// デストラクタ

	// === ライフサイクルメンバ関数 ===

	HRESULT Init() override;	// 初期設定
	void	Uninit() override;	// 終了処理
	void	Update() override;	// 更新処理
	void	Draw() override;	// 描画処理

	//// === 静的メンバ関数 ===

	static CTutorialPlayer* Create(D3DXVECTOR3 InitPos); // 生成
private:
};

#endif // _PALYER_H_